app/views/house_rules/index.html.erb

<ul class="list-group">
  <% @game.house_rules.sort_by { |hr| hr.user_id == current_user.id ? 0 : 1 }.each do |house_rule| %>
---
SELECT "house_rules".* FROM "house_rules" WHERE "house_rules"."game_id" = ?  [["game_id", 1]]