app/views/chatrooms/show.html.erb

      <ul id="messages" class="list-unstyled">
        <% @chatroom.messages.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = ?  [["chatroom_id", 1]]