app/views/games/show.html.erb


      <%= form_with(url: current_user.games.include?(@game) ? url_for(user_game_path) : url_for(user_games_path), method: current_user.games.include?(@game) ? :delete : :post, local: true) do |form| %>
---
SELECT 1 AS one FROM "games" INNER JOIN "user_games" ON "games"."id" = "user_games"."game_id" WHERE "user_games"."user_id" = ? AND "games"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

        <%= form.hidden_field :game_id, value: @game.id %>
        <% if current_user.games.include?(@game) %>
---
SELECT 1 AS one FROM "games" INNER JOIN "user_games" ON "games"."id" = "user_games"."game_id" WHERE "user_games"."user_id" = ? AND "games"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]


      <% if @game.game_variants.any? %>
---
SELECT "game_variants".* FROM "game_variants" WHERE "game_variants"."game_id" = ?  [["game_id", 1]]
SELECT 1 AS one FROM "game_variants" WHERE "game_variants"."game_id" = ? LIMIT ?  [["game_id", 1], ["LIMIT", 1]]

          <tbody>
            <% @game.game_variants.each do |variant| %>
---
SELECT "game_variants".* FROM "game_variants" WHERE "game_variants"."game_id" = ?  [["game_id", 1]]

      <h2>Comments</h2>
      <% @game.comments.sort_by { |comment| comment.user == current_user ? 0 : 1 }.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."game_id" = ?  [["game_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

          <p class="card-text"><%= @game.calculate_average_rate %></p>
            <% if user_signed_in? && !@game.ratings.exists?(user_id: current_user.id) %>
---
SELECT 1 AS one FROM "ratings" WHERE "ratings"."game_id" = ? AND "ratings"."user_id" = ? LIMIT ?  [["game_id", 1], ["user_id", 1], ["LIMIT", 1]]

                  <%= form.label :value, "Choose a rating" %>
                  <%= form.select :value, Rating::GAME_RATING_RANGE, {}, {class: "form-control", name: "rating[value]"} %>
---
SELECT SUM("ratings"."value") FROM "ratings" WHERE "ratings"."game_id" = ?  [["game_id", 1]]