app/controllers/chatrooms_controller.rb

  def index
    @chatrooms = Chatroom.all
---
SELECT "chatrooms".* FROM "chatrooms"

  def create
    @chatroom = current_user.chatrooms.build(chatroom_params)

    if @chatroom.save
---
INSERT INTO "chatrooms" ("name", "owner_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Monopoly players here"], ["owner_id", 1], ["slug", nil], ["created_at", "2023-03-26 03:00:12.923389"], ["updated_at", "2023-03-26 03:00:12.923389"]]

  def show
    @chatroom = Chatroom.find_by(slug: params[:slug])
    puts "Slug: #{params[:id]}"
    raise "Chatroom not found" if @chatroom.nil?
    @message = Message.new
    @messages = @chatroom.messages.where(chatroom_id: @chatroom.id).includes(:user)
---
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."slug" = ? LIMIT ?  [["slug", "monopoly-fans"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = ?  [["chatroom_id", 1]]