app/controllers/collections_controller.rb

SELECT "games".* FROM "games" INNER JOIN "user_games" ON "games"."id" = "user_games"."game_id" WHERE "user_games"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 6], ["OFFSET", 0]]
---
  def index
    @games = current_user.games.paginate(page: params[:page], per_page: 6)