app/controllers/comments_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "good"], ["user_id", 2], ["game_id", 1], ["created_at", "2023-03-24 11:15:26.876203"], ["updated_at", "2023-03-24 11:15:26.876203"]]
---
  def create
    @game = Game.find(params[:game_id])
    @comment = @game.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @comment = current_user.comments.find(params[:id])
    @comment.destroy