app/controllers/games_controller.rb

  def index
    @games = Game.paginate(page: params[:page], per_page: 6)
---
SELECT "games".* FROM "games" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "games"

  def q_and_as
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]