app/controllers/house_rules_controller.rb

INSERT INTO "house_rules" ("name", "content", "user_id", "created_at", "updated_at", "game_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "houserule 101"], ["content", "hshsladjfk;aj;f"], ["user_id", 3], ["created_at", "2023-03-25 15:49:55.345690"], ["updated_at", "2023-03-25 15:49:55.345690"], ["game_id", 1]]
---
  def create
    @house_rule = @game.house_rules.build(house_rule_params)
    @house_rule.user = current_user

    if @house_rule.save

UPDATE "house_rules" SET "content" = ?, "updated_at" = ? WHERE "house_rules"."id" = ?  [["content", "ssssttttttt"], ["updated_at", "2023-03-25 15:31:34.893105"], ["id", 1]]
---
  def update
    if @house_rule.update(house_rule_params)

DELETE FROM "house_rules" WHERE "house_rules"."id" = ?  [["id", 2]]
---
  def destroy
    @house_rule.destroy

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_game
    @game = Game.find(params[:game_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "house_rules".* FROM "house_rules" WHERE "house_rules"."game_id" = ? AND "house_rules"."id" = ? LIMIT ?  [["game_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_house_rule
    @house_rule = @game.house_rules.find(params[:id])