app/controllers/messages_controller.rb

  def create
    @chatroom = Chatroom.find_by(slug: params[:chatroom_id])
    @message = current_user.messages.build(message_params)
    @message.chatroom = @chatroom

    if @message.save
---
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."slug" = ? LIMIT ?  [["slug", "monopoly-fans"], ["LIMIT", 1]]
INSERT INTO "messages" ("body", "chatroom_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hi"], ["chatroom_id", 1], ["user_id", 1], ["created_at", "2023-03-26 03:06:09.686259"], ["updated_at", "2023-03-26 03:06:09.686259"]]