app/controllers/ratings_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "ratings" ("game_id", "user_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["game_id", 1], ["user_id", 2], ["value", 5], ["created_at", "2023-03-24 13:02:05.599932"], ["updated_at", "2023-03-24 13:02:05.599932"]]
---
  def create
    @game = Game.find(params[:game_id])
    @rating = @game.ratings.new(rating_params)
    @rating.user = current_user

    if @rating.save