app/controllers/user_games_controller.rb

  def create
    @game = Game.find(params[:game_id])
    current_user.games << @game
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "user_games" ("user_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["game_id", 1], ["created_at", "2023-03-23 22:06:52.149159"], ["updated_at", "2023-03-23 22:06:52.149159"]]

  def destroy
    @game = Game.find(params[:game_id])
    current_user.games.delete(@game)
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "user_games" WHERE "user_games"."user_id" = ? AND "user_games"."game_id" = ?  [["user_id", 1], ["game_id", 1]]